share/tutorials/incompressible/adjoint-shape-optimization/pitz_daily/constant/transportProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      transportProperties;
}

transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 1e-5;
lambda          lambda   [0 -2 1 0 0 0 0] 1e5;
alphaMax        alphaMax [0 0 -1 0 0 0 0] 200.0;

// vim: set ft=foam et sw=2 ts=2 sts=2:
