share/tutorials/incompressible/adjoint-shape-optimization/pitz_daily/0/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 14.855;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform 14.855;
  }
  outlet
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 14.855;
  }
  lowerWall
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 14.855;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
