share/tutorials/incompressible/adjoint-shape-optimization/pitz_daily/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  "(p|pa)"
  {
    solver          GAMG;
    tolerance       1e-08;
    relTol          0.01;
    smoother        GaussSeidel;
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
  }
  "(U|Ua|k|epsilon)"
  {
    solver          smoothSolver;
    smoother        GaussSeidel;
    nSweeps         2;
    tolerance       1e-08;
    relTol          0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
  pRefCell 0;
  pRefValue 0;
}
relaxationFactors
{
  fields
  {
    "(p|pa)"        0.3;
    alpha           0.1;
  }
  equations
  {
    "(U|Ua)"        0.7;
    "(k|epsilon)"   0.7;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
